<?php

return [
    // 1000001 - 1000300 通用错误提醒
    '1000001' => '网络状态异常,请重试!',
    '1000002' => '请求失败,请重试!',
    '1000003' => '服务器端没有正确地响应,请重试!',
    '1000004' => '未通过身份验证!',
    '1000005' => '请求资源不存在!',
    '1000006' => '存储资源失败,请重试!',
    '1000007' => '更新资源失败,请重试!',
    '1000008' => '删除资源失败,请重试!',
    '1000009' => '接口版本号未知!',
    '1000010' => '调用内部请求失败!',
    '1000011' => '请求过于频繁,稍后再试!',
    '1000012' => '尚未被授权执行该请求!',
    '1000013' => '请求未满足头部要求!',
    '1000014' => '请求的资源已被永久移除!',
    '1000015' => '状态冲突,无法请求该资源!',
    '1000016' => '请求参数错误!',
];
